Revit 2027 API
ParameterTypeId.AnalyticalMemberRotation Property
 "Cross-Section Rotation": Used for Analytical Member
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalMemberRotation { get; }
Public Shared ReadOnly Property AnalyticalMemberRotation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalMemberRotation {
	ForgeTypeId^ get ();
}
static member AnalyticalMemberRotation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace